---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisDetailedModel
source: html/7bd42c54-dc8f-7413-4fcd-92b9b246ecbf.htm
---
# Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisDetailedModel Property

Detailed Model.

## Syntax (C#)
```csharp
public static ForgeTypeId EnergyAnalysisDetailedModel { get; }
```